using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PDFWpfLIbrary
{
    
    public partial class GetQuestions
    {
        public static TestElement[] TestElements = new TestElement[]
        {
            //1     ================================================================================================================================================
            //=================================================================================================================================================
            new TestElement
            {
                Question = "Что из ниже перечисленного не является основой формирования информационной культуры?",
                RightOpinion="принцип узкой специализации",
                Opinions= new string[]{ "умение ориентироваться в информационных потоках", "знания о законах функционирования информационной среды", "знания об информационной среде"}
            },

            new TestElement
            {
                Question = "Что принято понимать под информационной грамотностью согласно работам Международной ассоциации школьных библиотек?",
                RightOpinion="наличие знаний и умений для эффективного поиска информации",
                Opinions= new string[]{ "способность самостоятельно обеспечить комфортные условия обработки имформации", "наличие знаний и умений для обращения с любой известной информационной системой", "способность передачи информации" }
            },

            new TestElement
            {
                Question = "По способу восприятия информации человеком различают следующие виды информации:",
                RightOpinion="визуальную, звуковую, тактильную, обонятельную, вкусовую",
                Opinions= new string[]{ "математическую, биологическую, медицинскую, психологическую и пр.", "текстовую, числовую, графическую, звуковую и пр.", "научную, социальную, политическую, экономическую, религиозную и пр." }
            },

            new TestElement
            {
                Question = "Информационный процесс - это...",
                RightOpinion="Действия, выполняемые с информацией",
                Opinions= new string[]{"Хранение информации", "Обработка информации", "Передача информации" }
            },
            //2        =================================================================================================================================================
            //=================================================================================================================================================

             new TestElement
             {
                Question = "В кинотеатре 16 рядов по 32 места в каждом. \nКакое количество информации в битах содержит сообщение о том, что продан билет в 8-м ряду?",
                RightOpinion="4",
                Opinions= new string[]{"16", "2", "8" }
             },

             new TestElement
             {
                Question = "Статья, набранная на компьютере, содержит 32 страницы, на каждой странице 32 строки, в каждой строке 25 символов.\n Определите информационный объём статьи в кодировке Windows-1251, в которой каждый символ кодируется 8 битами. ",
                RightOpinion="25",
                Opinions= new string[]{"125", "32", "64" }
             },

            new TestElement
            {
                Question = "В мешке лежит 64 красных яблока. Сколько информации содержит сообщение, что достали красное яблоко?",
                RightOpinion="0",
                Opinions= new string[]{"1", "8", "6" }
            },

            new TestElement
            {
                Question = "В двоичном коде один двоичный разряд несет ... информации.",
                RightOpinion="1 бит",
                Opinions= new string[]{"8 бит ", "1 байт", "2 бита" }
            },
            //3     =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Выберите из предлагаемых вариантов только нематериальную систему.",
                RightOpinion="разговорный язык",
                Opinions= new string[]{ "оркестр", "Солнечная система", "нотные записи" }
             },

             new TestElement
             {
                Question = "Апельсин состоит из частей-долек. Выберите правильное утверждение о частях апельсина?",
                RightOpinion="Апельсин состоит из множества подобных объектов",
                Opinions= new string[]{ "Апельсин состоит из множества различных объектов", }
             },

            new TestElement
            {
                Question = "Структура системы - это",
                RightOpinion="элементы, из которых состоит система",
                Opinions= new string[]{ "порядок связей между элементами системы", }
            },

            new TestElement
            {
                Question = "Что понимается под управлением?",
                RightOpinion=" планомерное воздействие на некоторый объект с целью изменения его свойств",
                Opinions= new string[]{ "планомерное воздействие на некоторый объект с целью достижения определенного результата", "управление движением объекта"}
            },
            //4     =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Для кодирования сообщения, состоящего только из букв A-000, M-11, N-01, E-001 и O-10,\n используется неравномерный по длине двоичный код. \nКакое (только одно!) из четырех полученных сообщений было передано без ошибок и может быть раскодировано:",
                RightOpinion="01100100011001",
                Opinions= new string[]{ "01100010001100", " 01100100011101", " 01100100011100" }
             },

             new TestElement
             {
                Question = "По  каналу  связи передаются  сообщения,  содержащие только  буквы А, Б, В, Г, Д, Е. \nДля передачи используется неравномерный двоичный код, удовлетворяющий  условию Фано;  \nдля  букв A, Б, В  используются  такие кодовые слова: А – 0, Б – 101, В – 110. \nКакова наименьшая возможная суммарная длина всех кодовых слов? Внимание: введите число цифрами.",
                RightOpinion="18",
                Opinions= new string[]{"16"}
             },

            new TestElement
            {
                Question = "Компонентами схемы обработки информации являются…",
                RightOpinion="исходные данные, правила обработки, исполнитель, результаты",
                Opinions= new string[]{ "исходные данные и правила их обработки", "исходные данные, исполнитель, правила обработки", "исходные данные и результаты" }
            },

            new TestElement
            {
                Question = "Кодирование информации — это",
                RightOpinion="преобразование информации в некоторую форму, удобную для хранения, передачи, обработки информации в дальнейшем",
                Opinions= new string[]{ "преобразование информации в форму, непонятную без наличия дополнительных знаний", "преобразование информации в форму, понятную только компьютеру"}
            },
            //5     =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Передача информации — это",
                RightOpinion="процесс распространения информации от источника к приемнику",
                Opinions= new string[]{ "целенаправленный процесс изменения содержания или формы представления информации", "процесс размещения информации на некотором носителе"}
             },

             new TestElement
             {
                Question = "Избыточность кода — это",
                RightOpinion="многократное повторение передаваемых данных",
                Opinions= new string[]{ "формализованные правила, определяющие последовательность шагов обработки информации", "функция, назначение системы", "частичная потеря избыточной информации при передаче" }
             },

            new TestElement
            {
                Question = "Средняя скорость передачи данных с помощью модема равна 30 Кбит/с. \nОпределите, сколько секунд понадобиться модему, чтобы передать 80 страниц текста в кодировке КОИ-8,\nесли считать, что на каждой странице в среднем 96 символов?",
                RightOpinion="2",
                Opinions= new string[]{"2", "3", "4" }
            },

            new TestElement
            {
                Question = "Документ объемом 20 Мбайт можно передать с одного компьютера на другой двумя способами: \nА) сжать архиватором, передать архив по каналу связи, распаковать; Б) передать по каналу связи без использования архиватора. \nКакой способ быстрее?",
                RightOpinion="Б",
                Opinions= new string[]{"A"}
            },
            //6     ================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "В каком веке появились первые электрические арифмометры?",
                RightOpinion="в XIX в.",
                Opinions= new string[]{ "в XVII в.", "в XVI в.", "в XIV в." }
             },

             new TestElement
             {
                Question = "Первая аналитическая машина была изобретена",
                RightOpinion="Ч. Беббиджем",
                Opinions= new string[]{ "В. Шиккардом", "Ж. Жаккардом", "Б. Паскалем" }
             },

            new TestElement
            {
                Question = "Первым инструментом для счета можно считать",
                RightOpinion="руку человека",
                Opinions= new string[]{ "арифмометр", "палочки", "камешки" }
            },

            new TestElement
            {
                Question = "Элементарная база компьютеров первого поколения — это",
                RightOpinion="электронная лампа",
                Opinions= new string[]{ "большая интегральная схема", "интегральная схема", "транзистор" }
            },
            //7     ================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Oтметьте принцип, который можно отнести к основополагающим принципам построения компьютеров",
                RightOpinion="принцип однородности памяти",
                Opinions= new string[]{ "принцип многозадачности", "принцип наличия способности к саморазвитию"}
             },

             new TestElement
             {
                Question = "Согласно принципу двоичного кодирования",
                RightOpinion="вся информация, предназначенная для обработки на компьютере, а также программы её обработки представляются в виде двоичного кода",
                Opinions= new string[]{"компьютер может обрабатывать информацию, закодированную любым двоичным способом", " любая информация может быть закодирована на компьютере только 2 раза" }
             },

            new TestElement
            {
                Question = "Заполните пропуски в предложении. … и данные размещаются в единой памяти, состоящей из …, \nимеющих свои номера (адреса). Это принцип … памяти.",
                RightOpinion=" команды, ячеек, адресности",
                Opinions= new string[]{ " информация, ячеек, единства", "команды, микросхем, единства", "информация, микросхем, адресност" }
            },

            new TestElement
            {
                Question = "Основополагающие принципы построения компьютеров были сформулированы независимо \nдруг от друга двумя крупнейшими учёными XX века — …",
                RightOpinion="Дж. фон Нейманом  С.А. Лебедевым",
                Opinions= new string[]{ "В.А. Котельниковым  Клодом Шенноном",}
            },
            //8     ================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Укажите название операционной системы.",
                RightOpinion="MS DOS",
                Opinions= new string[]{ "Adobe Photoshop", "Microsoft Access", }
             },

             new TestElement
             {
                Question = "Отметьте правильное высказывание о драйверах.",
                RightOpinion="специальные программы, управляющие работой подключённых к компьютеру внешних (периферийных) устройств",
                Opinions= new string[]{ "обеспечивают диалог пользователя с компьютером на базе графического интерфейса"}
             },

            new TestElement
            {
                Question = "Укажите название операционной системы.",
                RightOpinion="Linux",
                Opinions= new string[]{ "CorelDraw", "Microsoft Access" }
            },

            new TestElement
            {
                Question = "Отметьте правильное высказывание о драйверах.",
                RightOpinion="с их помощью осуществляется контроль за нормальным функционированием оборудования",
                Opinions= new string[]{"осуществляющие сжатие программ и данных" }
            },
            //9     ================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Укажите невозможное имя файла",
                RightOpinion=":DOKUMENTAC.TXT",
                Opinions= new string[]{ "DOKUM4", "TEXT.3.EXE", "CREML.BMP" }
             },

             new TestElement
             {
                Question = "Что из предложенного можно считать полным именем файла",
                RightOpinion="c:/kat/kniga.txt",
                Opinions= new string[]{ "f/kniga", "kniga.txt", "a:/kniga/ txt" }
             },

            new TestElement
            {
                Question = "Пользователь, перемещаясь из одного каталога в другой, последовательно посетил каталоги \nACADEMY, COURSE, GROUP, Е:, PROFESSOR, LECTIONS. \nПри каждом перемещении пользователь либо спускался в каталог на уровень ниже, либо поднимался на уровень выше. \nКаково полное имя каталога, из которого начал перемещение пользователь?",
                RightOpinion="Е:/GROUP/COURSE/ACADEMY",
                Opinions= new string[]{ "Е:/ACADEMY", "Е:/ACADEMY/COURSE/GROUP", "Е:/PROFESSOR/LECTIONS/ACADEMY" }
            },

            new TestElement
            {
                Question = "Определите, какое из указанных имен файлов удовлетворяет маске A?ce*s.m*",
                RightOpinion="Access.mdb",
                Opinions= new string[]{ "Accesst.dbf", " Acess.md", "Akcces.m1" }
            },
            //10        ================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = " В позиционных системах счисления основание системы счисления — это",
                RightOpinion="величина, равная максимальному количеству знаков, используемых для записи числа",
                Opinions= new string[]{ " цифры 1, 2, 3, 4, 5, 6, 7, 8, 9", "правила арифметических действий", "числовой разряд" }
             },

             new TestElement
             {
                Question = "Дано a = EA16, b = 3548. Какое из чисел С, записанных в двоичной системе счисления, удовлетворяет неравенству a < C < b?",
                RightOpinion="111010112",
                Opinions= new string[]{ " 111011002", "111011102", "111010102" }
             },

            new TestElement
            {
                Question = "Решите уравнение 145 + x = 247. Ответ запишите в троичной системе счисления. Основание системы счисления указывать не нужно.",
                RightOpinion="100",
                Opinions= new string[]{"101",}
            },

            new TestElement
            {
                Question = " Укажите через запятую в порядке возрастания все десятичные числа, не превосходящие 20,\nзапись которых в системе счисления с основанием 3 начинается на 2.",
                RightOpinion="2, 6, 7, 8, 18, 19, 20",
                Opinions= new string[]{ "2, 6, 7, 15, 18, 19, 22", "2, 3, 4, 8, 19, 18, 20",}
            },
            //11        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = " Переведите из двоичной системы счисления в восьмеричную число 101010112.",
                RightOpinion="253",
                Opinions= new string[]{ " 2223", "185", "523" }
             },

             new TestElement
             {
                Question = "Переведите из восьмеричной системы счисления в шестнадцатеричную число 718.",
                RightOpinion="39",
                Opinions= new string[]{ "E4", "47", "71" }
             },

            new TestElement
            {
                Question = "Сколько значащих нулей содержится в двоичной записи суммы чисел a = 1058, b = С616?",
                RightOpinion="5",
                Opinions= new string[]{"3", "4", "2" }
            },

            new TestElement
            {
                Question = " Сколько натуральных чисел удовлетворяет неравенству: 3168 < x < DE16?",
                RightOpinion="15",
                Opinions= new string[]{"12", "14", "17" }
            },
            //12        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Чему равна сумма чисел D816 и F716^?",
                RightOpinion="1CF1^6",
                Opinions= new string[]{ "1D51^6", " 28F1^6", "2951^6" }
             },

             new TestElement
             {
                Question = "Чему равна разность чисел 503^8 и 357^8?",
                RightOpinion="124^8",
                Opinions= new string[]{ "222^8", "146^8", " 224^8" }
             },

            new TestElement
            {
                Question = "Чему равно произведение чисел 325 и 135?",
                RightOpinion="1021^5",
                Opinions= new string[]{ "3131^5", "421^5", "416^5" }
            },

            new TestElement
            {
                Question = "Сколько значащих нулей в двоичной записи числа 8^740 – 2^900 + 7?",
                RightOpinion="897",
                Opinions= new string[]{"899", "898", "896" }
            },
            //13        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = " Определите представление в памяти компьютера числа 157^10 в 8-разрядной ячейке памяти в формате «без знака».",
                RightOpinion="10011101",
                Opinions= new string[]{ "10111001", "01001110", "01110101" }
             },

             new TestElement
             {
                Question = "Определите представление в памяти компьютера числа –102^10 в 8-разрядной ячейке памяти в формате «со знаком».",
                RightOpinion="10011010",
                Opinions= new string[]{ "01100110", "10011001", "11100110" }
             },

            new TestElement
            {
                Question = "Какое число получится, если сложить 83^10 и 204^10 в 8-битном формате без знака?",
                RightOpinion="31",
                Opinions= new string[]{"23", "14", "56" }
            },

            new TestElement
            {
                Question = " Для чисел 0.009625 × 10^3 и 6 найдите произведение, и представьте его в нормализованном виде.",
                RightOpinion="5.775 × 10^1",
                Opinions= new string[]{ "5.775 × 10^3", "5.7 × 10^1", "5.7" }
            },
            //14        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Укажите фрагмент текста, имеющий максимальную сумму кодов символов (в таблице ASCII).",
                RightOpinion="«kzn»",
                Opinions= new string[]{ "«19k»", "«z99»", "«91А»" }
             },

             new TestElement
             {
                Question = "Используется кодовая таблица CP-1251 (Windows Cirillic). \nСколько килобайт будет занимать файл в простом текстовом формате (plain text), \nесли в тексте 200 страниц, на странице 32 строки, а в строке в среднем 48 символов?",
                RightOpinion="300",
                Opinions= new string[]{ "307,2", "384", "2400" }
             },

            new TestElement
            {
                Question = "Сообщение на русском языке было первоначально записано в 16-битном коде Unicode.\nПри его перекодировке в 8-битную кодировку КОИ-8 информационное сообщение уменьшилось на 960 бит. \nКакова длина сообщения в символах?",
                RightOpinion="120",
                Opinions= new string[]{"140", "110", "100" }
            },

            new TestElement
            {
                Question = "Одна кодировочная таблица содержит 2048 символов. \nДля кодирования символа с помощью второй таблицы требуется на 2 бита меньше, \nчем для кодирования символа с помощью первой таблицы.\nОпределите, сколько символов включено во вторую кодировочную таблицу.",
                RightOpinion="512",
                Opinions= new string[]{"64", "256", "1024" }
            },
            //15        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Страница видеопамяти 16000 байт. Дисплей работает в режиме 320×400 пикселей. Сколько цветов в палитре:",
                RightOpinion="2",
                Opinions= new string[]{ "4", "8", "16" }
             },

             new TestElement
             {
                Question = "Для кодирования цвета фона Интернет-страницы используется атрибут bgcolor=»#ХХХХХХ», \nгде в кавычках задаются шестнадцатеричные значения \nинтенсивности цветовых компонент в 24-битной RGB-модели. \nКакой цвет будет у страницы, заданной тэгом <body bgcolor=»#80FF80″>?",
                RightOpinion=" светло-зеленый",
                Opinions= new string[]{"светло-синий", "розовый", "желтый" }
             },

            new TestElement
            {
                Question = " Голубой цвет на компьютере с объемом страницы видеопамяти 250 Кбайт кодируется кодом 00000011. \nКакова максимальная разрешающая способность графического дисплея?",
                RightOpinion="640×400",
                Opinions= new string[]{"640×800", "640×200", "320×400" }
            },

            new TestElement
            {
                Question = " Рисунок размером 64 на 128 пикселей занимает в памяти 7 Кбайт (сжатие изображения не проводилось). \nНайдите максимально возможное количество цветов в палитре изображения.",
                RightOpinion="128",
                Opinions= new string[]{"117", "132", "182" }
            },
            
            //16        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Количество информации, которое необходимо для кодирования дискретных уровней цифрового звука, называют:",
                RightOpinion=" глубиной кодирования",
                Opinions= new string[]{ "фрагментацией", "дискретизацией", "квантованием" }
             },

             new TestElement
             {
                Question = "Заполните пропуски в предложении \nВ основе … звука с использованием компьютера лежат процесс … \nколебаний воздуха в колебания электрического тока и последующая … аналогового электрического сигнала.",
                RightOpinion="кодирования, преобразования, дискретизация",
                Opinions= new string[]{ "квантования, преобразования, дискретизация", "кодирования, преобразования, квантование", "преобразования, кодирования, дискретизация" }
             },

            new TestElement
            {
                Question = "Объем свободной памяти на диске 5,15 Мбайт, разрядность звуковой платы — 16 бит. \nКакой может быть продолжительность звучания аудиофайла (моно), записанного с частотой дискретизации 22,05 кГц?",
                RightOpinion="≈122 с",
                Opinions= new string[]{ "≈113 с", "1 мин", " 23 с" }
            },

            new TestElement
            {
                Question = "Производилась двухканальная (стерео) звукозапись с частотой дискретизации 48 кГц и 24-битным разрешением. \nВ результате был получен файл размером 5625 Мбайт, сжатие данных не производилось. \nОпределите приблизительно, сколько времени (в минутах) производилась запись. \nВ качестве ответа укажите ближайшее к времени записи целое число, кратное 5.",
                RightOpinion="340",
                Opinions= new string[]{"240", "430", "330" }
            },


            //17        =================================================================================================================================================
            //================================================================================================================================================
             new TestElement
             {
                Question = "Из какого языка заимствовано слово «логика»?",
                RightOpinion="из древнегреческого",
                Opinions= new string[]{ " из древнеегипетского", "из санскрита" }
             },

             new TestElement
             {
                Question = "Что такое логика?",
                RightOpinion="наука о законах и формах правильного мышления",
                Opinions= new string[]{ "наука о человеке", "наука о жизни" }
             },

            new TestElement
            {
                Question = " Кто является основоположником формальной логики?",
                RightOpinion="Аристотель",
                Opinions= new string[]{ "Диоген", "Софокл"}
            },

            new TestElement
            {
                Question = "Что изучает формальная логика?",
                RightOpinion="логические высказывания",
                Opinions= new string[]{ "структуру познания", "деятельность человека" }
            },
            //18        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Как называется повествовательное предложение, про которое можно однозначно сказать истинно оно или ложно?",
                RightOpinion="логическое высказывание",
                Opinions= new string[]{ "афоризм", "формула"}
             },

             new TestElement
             {
                Question = " К чему можно свести обработку двоичных данных?",
                RightOpinion="к выполнению логических операций",
                Opinions= new string[]{ "к соблюдению схемы", "к выполнению задачи" }
             },

            new TestElement
            {
                Question = " Кто предложил применить для исследования логических высказываний математические методы?",
                RightOpinion=" Д. Буль",
                Opinions= new string[]{ "Р. Орвин","В. Ромис" }
            },

            new TestElement
            {
                Question = "Кем был Д. Буль?",
                RightOpinion="химиком",
                Opinions= new string[]{ "математиком", "физиком"}
            },
            //19        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Как называется математический аппарат, с помощью которого записывают, вычисляют, \nупрощают и преобразуют логические высказывания?",
                RightOpinion="алгебра логики",
                Opinions= new string[]{"теория логики", "физика логики" }
             },

             new TestElement
             {
                Question = "Что определяет алгебра логики?",
                RightOpinion="правила выполнения операций с логическими величинами",
                Opinions= new string[]{ "правила работы компьютера", "правила вычисления"}
             },

            new TestElement
            {
                Question = "Как с английского переводится термин, означающий «программное обеспечение»?",
                RightOpinion="«Мягкое оборудование»",
                Opinions= new string[]{"«Твёрдое оборудование»", "«Жидкое оборудование»"}
            },

            new TestElement
            {
                Question = "Что называют программным обеспечением?",
                RightOpinion="программы, выполняющие ввод, обработку и вывод данных",
                Opinions= new string[]{ "программы, предназначенные для создания данных", "программы, обеспечивающие обработку вводимой информации"}
            },
            //20        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = " Какие выделяют виды программного обеспечения?",
                RightOpinion="системные программы, прикладные программы и системы программирования",
                Opinions= new string[]{ "встроенные программы, вспомогательные программы и системы программирования", "системные программы, второстепенные программы и системы управления" }
             },

             new TestElement
             {
                Question = "С помощью каких программ пользователи решают свои задачи",
                RightOpinion="с помощью прикладных программ",
                Opinions= new string[]{ "с помощью системных программ", "с помощью систем программирования" }
             },

            new TestElement
            {
                Question = "Какие программы обеспечивают слаженную работу всех узлов компьютера?",
                RightOpinion="системные программы",
                Opinions= new string[]{"прикладные программы", "системы программирования" }
            },

            new TestElement
            {
                Question = "Что такое утилиты?",
                RightOpinion="служебные программы",
                Opinions= new string[]{ "способы обмена данными", "программы управления внешними устройствами", }
            },

            //21        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Как называются программы для управления внешними данными?",
                RightOpinion="Как называются программы для управления внешними данными?",
                Opinions= new string[]{"утилиты", "терминалы" }
             },

             new TestElement
             {
                Question = "К какому типу ПО относятся драйверы?",
                RightOpinion="к системным программам",
                Opinions= new string[]{ "к прикладным программам", "к системам программирования" }
             },

            new TestElement
            {
                Question = "К какому виду программного обеспечения относятся утилиты и операционные системы?",
                RightOpinion="к системным программам",
                Opinions= new string[]{ "к системам программирования", "к системам программирования"}
            },

            new TestElement
            {
                Question = "Как называется программа, у которой есть версии для разных операционных систем?",
                RightOpinion="кроссплатфоменная",
                Opinions= new string[]{ "кроссерфинговая", "кроссфитовая" }
            },
            //22        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Вася забыл пароль к Windows XP, но помнил алгоритм его получения из строки подсказки «23ABN12QR8N»: \nесли последовательности символов «AB» и «QR» поменять местами, а затем из получившейся строки удалить все символы «N»,\nто полученная последовательность и будет паролем. Определите пароль:",
                RightOpinion="23QR12AB8",
                Opinions= new string[]{ " 23AB12QR8", "23QRAB8", "23QR128" }
             },

             new TestElement
             {
                Question = "При составлении расписания на вторник учителя высказали свои пожелания по поводу расположения первых пяти уроков. \nУчитель математики (М) хочет иметь первый или второй урок, \nучитель физики (Ф) — второй или третий, учитель информатики (И) — первый или четвертый, \nучитель биологии (Б) — третий или четвертый. \nКакое расписание устроит всех учителей?",
                RightOpinion="МФБИ",
                Opinions= new string[]{ "МБФИ", "ИМБФ", "МИФБ" }
             },
            new TestElement
            {
                Question = "Объем свободной памяти на диске 5,15 Мбайт, разрядность звуковой платы — 16 бит. \nКакой может быть продолжительность звучания аудиофайла (моно), записанного с частотой дискретизации 22,05 кГц?",
                RightOpinion="≈122 с",
                Opinions= new string[]{ "≈113 с", "1 мин", " 23 с" }
            },

            new TestElement
            {
                Question = "Производилась двухканальная (стерео) звукозапись с частотой дискретизации 48 кГц и 24-битным разрешением. \nВ результате был получен файл размером 5625 Мбайт, сжатие данных не производилось.\nОпределите приблизительно, сколько времени (в минутах) производилась запись. \nВ качестве ответа укажите ближайшее к времени записи целое число, кратное 5.",
                RightOpinion="340",
                Opinions= new string[]{"240", "430", "330" }
            },
            //23        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "«Компьютерная» технология создания текстовых документов по сравнению с «бумажной» технологией по­зволяет",
                RightOpinion="копировать документ без особых затрат",
                Opinions= new string[]{ "хранить документ", "снижать затраты на технику", "редактировать документ" }
             },

             new TestElement
             {
                Question = " Простой текстовый редактор целесообразно использо­вать для создания",
                RightOpinion="небольших заметок",
                Opinions= new string[]{ "чертежей", "красочных буклетов", "отчетов с использованием графических элементов" }
             },

            new TestElement
            {
                Question = " Пример простого текстового редактора — программа",
                RightOpinion="Блокнот",
                Opinions= new string[]{ "Paint", "Excel"}
            },

            new TestElement
            {
                Question = " Основная часть окна текстового редактора, предназначенная для создания документа и работы с ним",
                RightOpinion="рабочая область",
                Opinions= new string[]{ "стандартная панель инструментов", "строка состояния", "панель инструментов Форматирование" }
            },
            //24        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Преимущество работы с электронным документом, по сравнению с рукописным",
                RightOpinion="удобство редактирования",
                Opinions= new string[]{ "отсутствие дорогостоящей компьютерной техники", "устойчивость к физическим воздействиям", "контрастность изображения" }
             },

             new TestElement
             {
                Question = "Текстовый процессор нецелесообразно использовать для создания",
                RightOpinion="программного кода",
                Opinions= new string[]{ "рекламных буклетов", "документов с различными видами и размерами шрифта"}
             },

            new TestElement
            {
                Question = "Справочная информация о редактируемом документе в текстовом процессоре выводится",
                RightOpinion="в строке состояния",
                Opinions= new string[]{ "на панели инструментов Форматирование", "в рабочей области", "на стандартной панели инструментов" }
            },

            new TestElement
            {
                Question = "Пример текстового процессора",
                RightOpinion="Word",
                Opinions= new string[]{"Excel", "Paint" }
            },
            //25        =================================================================================================================================================
            //=================================================================================================================================================
             new TestElement
             {
                Question = "Совокупность слайдов информационного или рекламного характера",
                RightOpinion="презентация",
                Opinions= new string[]{ "система представления презентаций", "программа для создания презентаций", "система обработки презентаций" }
             },

             new TestElement
             {
                Question = "Заполните пропуски в предложении\nМакет слайда — это просто набор заполнителей, расположенных в \nтеле … и предназначенных для хранения …. В зависимости от \nвыбранного …, на слайде могут располагаться текст, графики, \nкартинки, звуковые и видеофайлы, таблицы, диаграммы и пр.",
                RightOpinion="слайда, информации, макета",
                Opinions= new string[]{ "слайда, данных, макета", "презентации, данных, макета", "презентации, данных, шаблона" }
             },

            new TestElement
            {
                Question = "На размер файла презентации существенно влияет размер вставляемых графических объектов. \nВо сколько раз изменится размер презентации, если сменить рисунок размером 20 Кбайт \nна рисунок размером 2 Мбайт?",
                RightOpinion="102,4",
                Opinions= new string[]{"102,7", "101", "102" }
            },

            new TestElement
            {
                Question = "Для презентации своего продукта в режиме автоматической прокрутки необходимо порядка 10 слайдов. \nСколько времени должен демонстрироваться один слайд, \nесли у покупателя есть не более 1 минуты для просмотра всей презентации?",
                RightOpinion="6c",
                Opinions= new string[]{"10c", "3c", "7c" }
            },
        };
    }
    public struct TestElement
    {
        public string Question { get; set; }
        public string RightOpinion { get; set; }    
        public string[] Opinions;
    }
}